export const questions = [
  {
    language: 'React',
    properties: [
      {
        title: 'React - это ...? ',
        answers: ['библиотека', 'фреймворк', 'приложение'],
        correct: 0,
      },
      {
        title: 'Компонент - это ... ',
        answers: [
          'приложение',
          'часть приложения или страницы',
          'то, что я не знаю что такое',
        ],
        correct: 1,
      },
      {
        title: 'Что такое JSX?',
        answers: [
          'Это простой HTML',
          'Это функция',
          'Это тот же HTML, но с возможностью выполнять JS-код',
        ],
        correct: 2,
      },
    ],
  },
  {
    language: 'JavaScript',
    properties: [
      {
        title: 'Количество типов данных в JavaScript? ',
        answers: ['7', '8', '9'],
        correct: 1,
      },
      {
        title: 'Компонент - это ... ',
        answers: [
          'приложение',
          'часть приложения или страницы',
          'то, что я не знаю что такое',
        ],
        correct: 1,
      },
      {
        title: 'Что такое JSX?',
        answers: [
          'Это простой HTML',
          'Это функция',
          'Это тот же HTML, но с возможностью выполнять JS-код',
        ],
        correct: 2,
      },
    ],
  },
  {
    language: 'CSS',
    properties: [
      {
        title: 'Для чего используется CSS?',
        answers: ['7', '8', '9'],
        correct: 1,
      },
      {
        title: 'Компонент - это ... ',
        answers: [
          'приложение',
          'часть приложения или страницы',
          'то, что я не знаю что такое',
        ],
        correct: 1,
      },
      {
        title: 'Что такое JSX?',
        answers: [
          'Это простой HTML',
          'Это функция',
          'Это тот же HTML, но с возможностью выполнять JS-код',
        ],
        correct: 2,
      },
    ],
  },
  {
    language: 'HTML',
    properties: [
      {
        title: 'HTML - это ...?',
        answers: ['7', '8', '9'],
        correct: 1,
      },
      {
        title: 'Компонент - это ... ',
        answers: [
          'приложение',
          'часть приложения или страницы',
          'то, что я не знаю что такое',
        ],
        correct: 1,
      },
      {
        title: 'Что такое JSX?',
        answers: [
          'Это простой HTML',
          'Это функция',
          'Это тот же HTML, но с возможностью выполнять JS-код',
        ],
        correct: 2,
      },
    ],
  },
];
